// 18位（身份证号）
export function checkIdCard(value){
    return /^[1-9]\d{5}(18|19|20)\d{2}((0[1-9])|(1[0-2]))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$/.test(value)
}

/*
    https://blog.csdn.net/qq_37139060/article/details/96598632
*/
// 15位或者18位（身份证号）
export function checkIdCard1(value){
    return /(^[1-9]\d{5}(18|19|([23]\d))\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{3}[0-9Xx]$)|(^[1-9]\d{5}\d{2}((0[1-9])|(10|11|12))(([0-2][1-9])|10|20|30|31)\d{2}$)/.test(value)
}

// 电话
/*
    https://www.cnblogs.com/inkyi/p/5353774.html

    11位手机号：18911931207

    5位服务好：10086

    7位座机号：3571256

    3-4位区号+7位座机号：023-3571256

    3-4位区号+7位座机号+4位分机号：

    1023-3571256-1
    1023-3571256-12
    1023-3571256-123
    1023-3571256-1234
*/
export function checkTelPhone(value){
    return /^((\d{11})|(\d{3,4}-)*(\d{7,8})+(-\d{1,4})*|(\d{5}))$/.test(value)
}